// Задача 1: Задайте значения M и N. 
// Напишите программу, которая выведет все натуральные числа в промежутке от M до N. 
// Использовать рекурсию, не использовать циклы.

Console.WriteLine("Введите начало промежутка(M): ");
int m = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите конец промежутка(N): ");
int n = Convert.ToInt32(Console.ReadLine());